[
  {
    "id": "food-for-thought-dexter-thomas-soul-chef-catering",
    "title": "FOOD FOR THOUGHT Dexter Thomas, Soul Chef Catering",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1604420700/soulchef-catering_oktxcq.png",
    "date": "2020-11-03T16:08:03.247Z",
    "content": "#### Meet Dexter Thomas, founder of Soul Chef Catering, based at the Astor Theatre on Stanhope Road\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1604420408/dexter-soulchef-catering_agxvew.jpg \"Dexter on Instagram @soulchefcatering\")\n\nI was born in Jamaica, the middle child of five, spending my childhood either playing or in the kitchen since I was 9. At 17, I left the Caribbean to come to London with my elder brother to live with my dad and study catering at Lewisham college for 3 years. I always knew becoming a chef was the only thing I wanted to do. After work experience as an apprentice chef in a hotel, my career included the Crown Plaza, Savoy, and working for Jamie Oliver. When I met my wife, who works front-of-house in restaurants, 8 years ago, she wanted a change from London so we moved to Deal to be near her family. I was initially against the idea, especially as my first visit was on a rainy, miserable weekend in November! But I gave Deal a try and have ended up loving the place! Simon who owns [Rees and Rees jewellery](https://www.reesandreesjewellery.co.uk/) on High Street kindly provided a place to stay while we looked for somewhere of our own. Meantime, I was away a lot freelancing around the UK and Europe from Wales to Norway. It’s a good job my wife understands the industry! Lockdown stopped me travelling. I started cooking from home initially, providing food for those who couldn’t go out, while my wife was cycling around delivering meals. I was making such a mess in our kitchen, my wife said, \"I’m not doing this no more!\"\n\nThe owner of Little Green Shop recommended I talk to James at [the Astor](https://theastor.co.uk/) about using his kitchen, but literally the day we met, the national lockdown was announced. When we opened, we got the word out about Soul Food through Deal Delivers, being one of the first few on their Facebook page. We’d leave our business cards in the delivery bags and our reputation spread: people were telling their neighbours and friends how much they enjoyed this new Soul Chef food and the business took off.\n\nThe business grew so much, we have created two additional jobs: our driver who delivers our famous jerk food Friday to Sunday and my 16 year old weekend kitchen assistant.\n\nI started with home-cooked meals like mushroom spaghetti or stir-fried chicken fusion, but it wasn’t Caribbean SOUL food!\n\nMy mum always said do what you are used to, what makes your heart sing and you’re good at. So since lockdown eased, I started with one BBQ drum serving jerk pork for a fiver a box, and have bought two more since, to keep up with demand. I had more ideas and the Deal community were giving me feedback on the phone and reviews on Facebook asking for more.\n\nNow I look after veggies, vegans and coeliacs with their own separate BBQ drum. People often don’t realise 90% of traditional Jamaican food is plant based like yam, corn and banana, because meat is so expensive for islanders.\n\nWhat I love about Deal is how close-knit this community is and how they love and support local independents. I’ve never experienced this kind of thing anywhere else. That’s why the meat we buy is from Goodchild’s butchers in Walmer, our fish from [Jenkins](https://jenkinsandsonfishandgame.co.uk/free-home-delivery/) and our fruit and veg from [Bartlett and White](https://www.facebook.com/bartlettandwhite/).\n\nWatch this space, because we are looking at opening a small seating Jamaican themed restaurant in The Astor.\n\n***You can find Dexter at the Astor***\n\n***To order a pick up or delivery, call or text the Soul Food mobile 07871 176466, or message us through Facebook or Instagram. If you fancy their new family combo, just be sure to give Dexter 45 minutes notice, so they can have it ready.***\n\n***ORDER [NOW THROUGH FACEBOOK >](https://www.facebook.com/Soulchefcatering)***\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1604421912/dexter-soulchef-catering_qfeyxz.jpg)\n\n**Are you a cook?**\n\nNo- I’m a chef who loves cooking! Every dish I put on a plate has soul and love in it; if I’m not happy with it, it won’t leave my kitchen. Everything we do in Soul Chef is done out of passion.\n\n**Any cooking tips?**\n\nIf you’re going to do a dinner, don’t rush it: whatever you put in, you’ll get out. And don’t be afraid of experimenting- you’ve got to believe in yourself in the kitchen.\n\n**What’s your favourite dish?**\n\nIt’s not even Jamaican, but currently I am in love with jerk venison loin with a juniper berry jus, dauphinoise potato and tender stem broccoli. It’s going to be on our winter menu.\n\n**And a drink to go with it?**\n\nA nice bottle of red. Or a rum punch we can deliver along with our food if I’m feeling more Jamaican! I sent my friend Karl from [Cocktails in a Bottle](https://cocktailinabottle.co.uk/) the recipe for my rum punch and he has created his own version: delicious!\n\n**Your favourite restaurant in the Deal area?**\n\nEasily [The Lane’s burgers](https://www.thelanedeal.co.uk/) which are amazing.\n\nI can recommend my favourite chicken burger. The chicken is friend in buttermilk, served with lettuce, pickles and their own tomato sauce. Warning - they are so big, you certainly don’t feel hungry for a long time after!\n\n**And pub?**\n\nI can see [The Bohemian](http://www.thebohemian.co.uk/) from my lounge window and love sitting outside in their gardens with a nice pint of Blonde Whitstable Bay ale.\n\n**What’s the worst meal you’ve ever had?**\n\nI had a terrible Indian curry a while ago I can still taste, just recalling it.  Say no more.\n\n**And the best?**\n\nIn Thailand travelling on holiday with my wife. I like spice, I was raised on spice all my life, so a stand-out meal was fried fish coated in lime, chilli, lemongrass in a soup, those flavours were all so amazing together.\n\n**Your favourite TV cook?**\n\nWithout a doubt, Gordon Ramsay. He’s real and even if you don’t like what he says, he says it anyway. In any kitchen, you need to be able to stand your ground and say it how it is.\n\n**What do you think of Deal as a place to eat out?**\n\nI absolutely *love* Deal! Even if you are not from around here, perhaps just down for the day, there is so much choice of places to eat… even since I moved down 18 months ago, we are seeing so much more interest in food, like the new Turkish place opening alongside a more traditional style of cooking and restaurants which are still producing *really* good food."
  },
  {
    "id": "local-artisans-here-to-solve-your-present-problems",
    "title": "Local Artisans Here to Solve Your Present Problems",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1605339561/the-village-community-market_jsrg5r.png",
    "date": "2020-11-14T07:15:27.434Z",
    "content": "#### Unique, locally handcrafted, artisan Christmas gifts delivered to your door to solve present problems galore? Yes please we say!\n\n*Deal Delivers’ roving reporter Faye meets your chief present problem solver, Jo Holmes of The Village artisan market in Sondes Road, opposite The Courtyard bar restaurant.*\n\nLike all non-essential retailers, The Village had to close on 5 November for the second lockdown during the prime Christmas shopping period. Jo who has the Take a Seat upholstery stall in the Village was determined to support her fellow stallholders by bringing their collective offerings to a social media screen near you!\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1605340340/village_community_market_zer2xf.png)\n\n#### Who's in The Village?\n\n“The Village, a kind of craft traders collective, was the idea of [Neil from Walk Don’t Walk Gallery](https://www.dontwalkwalkgallery.com/) and Vince from [The Courtyard bar restaurant](https://www.thecourtyarddeal.co.uk/). We have been going for 18 months now with a wide range of self-employed local independent traders and craftspeople bringing their wares to the lovely people of Deal and town visitors. On a normal market day, you would find gifts galore and masses of unique items to decorate your home from linocut prints by [Jenny Preston](https://www.instagram.com/jennyprestonart/) to [Fiona Bradshaw’s lamps ](https://www.instagram.com/fionabradshawdesigns/)created from salvaged objects. [Barrels and Bespoak](https://www.instagram.com/barrelsandbespoak/) make rustic oak creations from old whiskey barrels for personalised interior and exterior furnishings and my own business- [Take A Seat](https://www.instagram.com/takeaseatupholstery/)- where people love my funky cushions and weekly chair clinic. Aside from larger commissions, I take in small ‘poorly’ chairs for same day turnround. Whether you are a local wanting some beautiful fabric for your dining chairs, a student doing your homework on grandad’s precious old tattered chair or a holiday home owner needing a stained chair recovering, I can help.\n\nThe Village is also home to the likes of Mrs McKenzie’s award winning marmalades, jams and chutneys, [PedaalDuwer’s](https://www.instagram.com/pedaalduwer/) vintage bike auction sales and hire, [LJ Artisan](https://www.instagram.com/ljartisan/), the Celtic jeweller (otherwise known as the wire maiden!) and [Hella Bella vintage clothing](https://www.instagram.com/hella_bella_thrifting/).\n\n![Jenny Preston](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1605339933/jenny-preston_rz60ww.png \"Credit: Jenny Preston Art\")\n\nDuring the first lockdown, a lot of our Village stall holders joined Deal Delivers. It made a big difference, not just to local people who wanted to access our products, but to us as self-employed stall holders for whom selling our wares at The Village was our main source of income. When we lost face to face contact with our customers, we could have lost our businesses. Plus in a double blow, many of us took that leap of faith to go it alone when The Village opened back in April 2019, so we were excluded from the government self-employment grant and local authority business grants and had to rely on Universal Credit.\n\nSome of us had businesses already, trekking round loads of different craft fairs, but with no point of sale. And our own Deal market proved impossible to get into because it was so successful, stall space was limited.\n\nOriginally The Village was a warehouse for Courts Furniture Shop, then an antiques warehouse, dark and gloomy. It was transformed by a lick of paint and Vince and Neil’s vision to create and extend an artisan hub around South Street and Sondes Road, giving local makers the undercover opportunity of an indoor market. People say The Village has all the hustle of a market with a laid-back vibe and very warm welcome. Stallholders are so open and chatty, we have customers who make a point of coming in every week for particular gifts or to get help creating unique interiors for their individual homes.\n\nPeople are still learning about The Village, mainly online and in the press, but we do have our A-boards on the pavements. Us traders are a local lot who love to support charities like the RNLI with prizes for their Christmas raffle last year, and for The Astor Theatre raffle. PedaalDuwer has also been actively supporting and leading community initiatives for meetups, friendship and support and of course, bike rides!\n\n![pedaalduwer](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1605340208/pedalduwee_ie8c8j.png \"Credit: Pedaalduwer\")\n\n\n\nIn the last lockdown, a few of us worked with [Love Local](https://www.facebook.com/lovelocaldeal1) and found the [Deal Delivers Facebook page](https://www.facebook.com/dealdelivers) a god-send with its free access and ability to post your own updates.\n\n> ##### Now the more tech-savvy amongst us have set up [The Village Market Instagram](https://www.instagram.com/thevillagecommunitymarket/) and [Facebook feeds](https://www.facebook.com/thevillagecommunitymarket), where we are offering all our wonderful local products for sale with FREE doorstep delivery to Deal and the surrounding areas.\n\nFor me, being on Deal Delivers has been fantastic. The page has offered a single point of access enabling local people to easily go to one place and know they are supporting local businesses. Deal Delivers has a much wider audience than The Village has. People get fed up of adverts streaming at them from multiple channels, but if they have a single channel, people will take time to consider what they want and enjoy an easy way to get those things.\n\nWe know this new lockdown is taking us into the critical Christmas shopping period, but The Village stallholders are all still desperately hoping we get to join the **Deal Late Night shopping event currently scheduled for Friday 4 December**. All our individual stall holders will be posting on our site and Deal Delivers to share ideas for Christmas gifts - unknown territory for many. I count myself lucky I have work booked in until January that I can deliver from my country workshop and can still go out to quote. All stallholders have different pressures but are working together to offer people a way to access goods and gifts in as safe a way as possible in the coming months. We have done a lot of work to make the market Covid compliant and customer numbers grew as confidence grew. We really benefited from day trippers, weekenders and those on staycations; the town has been buzzing for the last couple of months and we want to continue to give people options for individual and personalised gifts you can’t buy on Amazon, made by real people locally.”\n\n#### **Meet Jo**\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/w_1000,ar_16:9,c_fill,g_auto,e_sharpen/c_limit,f_auto,q_80,w_500/v1605340262/image0_d8bcga.jpg \"Meet Jo from Take a Seat Upholstery\")\n\nJo describes herself as a BFL - Back From Londoner! She worked in the public sector, predominantly as commissioner in the NHS, then headed innovation for Age UK National before redundancy saw her head back to Deal and spend the summer questioning what she wanted to do next, having given 35 years in public service. It was Jo’s aunt who inspired her to consider upholstery. “I bought a couple of chairs- I’ve always been a bit of magpie- and went to upholstery classes, initially locally, then at Faversham Upholstery School. Starting a stall at The Village market seemed a bit early, but I felt I had to jump in at the deep end and it’s gone really well.\n\nI also started selling Fusion mineral paint last year. In the last lockdown, fusion mineral paint was in such huge demand as people turned to upcycling home projects they had never got round to, that supplies ran out across the country, so my doorstep delivery was warmly welcomed by many! This lockdown we face a national foam shortage, because foam is a by-product from fuel. As fuel consumption has decreased, those by-products are not available to manufacturers, so prices have increased 20%. Fortunately, I also use a rubberised coir - mix coconut fibre or the traditional horsehair upholstery which has been around since 1920s. It lasts much longer than foam and is a much more eco-friendly product.\n\n#### PLEASE DO 1 THING TODAY, GIVE YOUR SUPPORT AND FOLLOW THE VILLAGE COMMUNITY ON INSTAGRAM\n\n##### @thevillagecommunitymarket\n\n##### @jennyprestonart\n\n##### @fionabradshawdesigns\n\n##### @pedaalduwer\n\n##### @barrelsandbespoke\n\n##### @ljartisan\n\n##### @Hellabella\n\n##### @takeaseatupholstery"
  },
  {
    "id": "meet-sharon-cullen-of-wellingtons-bistro",
    "title": "Meet Sharon Cullen of Wellingtons Bistro",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603749429/wellingtons_etfn7l.png",
    "date": "2020-10-26T21:37:51.566Z",
    "content": "Discover the fascinating back story of the local people who make Deal such a fabulous place to live and work. Get a unique inside track into the best places to eat and drink in the area, and who knows? You may pick up some hidden gems to try**.** \n\nMeet Sharon Cullen, the owner of Wellingtons Bistro and Bar on Beach Street which was launched on Valentine’s Day 2019. \n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603749712/image_s1rjmf.png)\n\nI was born locally in Kingsdown and still live in central Deal in the heart of town. I have three children: my eldest is 23 and works at Wellies while she is finishing her final year at university. In fact, she is running our newest initiative, the meatballs side of the business. My middle child lives in Birmingham after graduating and my youngest is a horse-mad 10-year old.\n\nI initially worked in marketing and as sales manager for a large food retailer before returning to education in my 40’s to study for a degree and masters in sociology and social policy at the University of Kent. I was about to start my PhD when my mum became ill with lung cancer. I stopped my studies to spend the last few months with her while she slowly passed away over the following year. Mum’s impending death made me take a long hard look at my life and ask: ‘Was I happy?’ Would my anger at politics actually be enough to allow me to make the changes in children’s social mobility and access to quality education I had written my dissertation on? I was married to a chef and was reflecting on how much we had both loved running our own catering business in the past, when the opportunity to buy Wellingtons came up. I remembered how in the early days of our marriage we used to play ‘ready steady cook’ at home! We both loved cooking, watching cookery programmes for ideas and generally got excited about food.\n\nAlthough I was divorced by then, my former husband was very supportive and helped me start making changes to elevate the original café image as a bit of a ‘greasy spoon’, to create the kind of place I knew Wellington’s could be. In the first few months, I got an alcohol license and spent six whole months - I kid you not - finding the perfect sausage! After all, I would have been foolish not to continue building on the wonderful reputation Wellington’s already had as a go-to breakfast café. So I focused on ensuring that - working in partnership with Rook’s Butchers and other suppliers, every item on our breakfast menu was of premium local ingredients. Me and the team had just got through our first year, introducing innovations like our popular tapas nights, when Covid hit. I brought the idea for a menu of Tapas Towers back from the time I spent in the Canaries, but with a 10pm curfew, we will be looking at our evening opening again and watching happy diners munching our tapas, burgers and wraps in Spring 21.\n\nOur ethos - particularly on good value - has very much been to look after locals first. I am most proud of growing our reputation for how wonderful the staff here are: incredibly attentive and polite. I truly believe in love and respect for both front of house and kitchen team. I earned my way through studying in later life by waitressing in restaurants and bars and have never forgotten the disgusting way I heard some chefs speaking to serving staff. I used to find myself thinking (prophetically?): ‘when I have own restaurant, I certainly won’t be doing it like this!’ At Wellington’s, all our team have each other’s back, a supportive vibe which reflects to our diners. Happy staff very definitely equal happy customers here. Meatballs are the latest innovation we have brought to Deal Delivers. Available Thursday to Monday to takeaway or be delivered to your door, customers can revel in delicate chicken and basil meatballs, gorgeous chili pork and sublime rustic beef. I know a recipe is working when I can’t stop eating! I got the idea when I saw a New York restaurant’s meatballs and as a working single parent, thought what a fantastic concept which would work as a healthy choice takeaway. We add our deliciously special salad with tenderstem broccoli and chargrilled peppers: it’s home cooking delivered to door.\n\nWe are amazed how well the meatball delivery service has gone, to be honest, and been touched by so much lovely feedback. 36 customers downloaded our Meatball Co app and ordered on the first day, which was fantastic, until we realised the app wasn’t regulating orders and kitchen was initially becoming overwhelmed by the positive response. It’s sorted now thankfully, and we are also delivering cocktails, our fruit shake ultimate milk shake or a freshly poured pint right to your door!\n\n**Are you a cook?**\n\nNot exactly, but I certainly enjoy having a go and I love to eat!\n\n**Any cooking tips?**\n\nKeep it simple - the best dishes are often the simplest (like our meatballs!). Oh, and to get great pork crackling, pour boiling water on the skin before you salt it.\n\n**What’s your favourite dish?**\n\nThis is hard to say because I have eclectic tastes, but I’m truffle mad! I’ve been known to sneak truffle oil into my handbag when eating out with my family. They laughed when I put truffle mash on my takeaway menu, but it’s been really popular- along with our truffle fries and skin on fries. When I launch our spring burger menu, I'll have to include a Truffle burger! \n\n**And a drink to go with it?**\n\nWine thanks: Sancerre if I’m feeling flush or a New Zealand sauvignon. My very favourite red is a Valopolicello Rapasso from the wine merchants on The Strand in Walmer: The Strand Wine Co.\n\n**What's your favourite restaurant in the Deal area?**\n\nHas to be The Courtyard, Sondes Road in Deal. I love the décor, the food, the service, none of which is pretentious. I like to mix up my menu choices, but I recently had a pork loin with cracking stick which was absolutely yummy. I’m kind of torn, so I’d like to give a huge shout-out to Victuals in St George’s Passage, too. I love everything they have done. It’s a wonderfully intimate place to eat with exceptional food.\n\n**And pub?**\n\nI’ll start at Bloody Mary’s on High Street, then move on to the Gaiety Bar or Bohemian where I admit to enjoying holing up in their intimate interior with a good friend and a bottle of vino. And for a different vibe and décor I might end up in the King’s Head!\n\n**Who's your favourite TV cook?**\n\nGotta be Rick Stein: I love following his travels through the Med and Mexico. I find it so interesting when he talks about culture and gets to know the locals and what they are cooking…\n\n**You can find Wellingtons Bistro & Bar at 27 Beach Street**\n\n**Open 9am - 2pm Monday to Friday through winter and weekends 9am - 3pm  [www.wellingtonsdeal.co.uk](https://www.wellingtonsdeal.co.uk/)**\n\n**Download the app for a Meatball delivery [www.themeatballcompany.co.uk](https://eur06.safelinks.protection.outlook.com/?url=http%3A%2F%2Fwww.themeatballcompany.co.uk%2F&data=04%7C01%7C%7C8f366f69358b47a54c8608d874309063%7C84df9e7fe9f640afb435aaaaaaaaaaaa%7C1%7C0%7C637387099207124775%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=RFhE41qWE%2Fi7UIwIlaSEvmgG3IeSgljgX6xFB6obEEc%3D&reserved=0)**"
  },
  {
    "id": "school-meals-help-this-october-half-term",
    "title": "School Meals Help this October Half Term",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603744762/free_school_meals_u8vumq.jpg",
    "date": "2020-10-26T20:25:06.183Z",
    "content": "#### These are the brilliant businesses that are pulling together and helping with free school meals this half term. Get in touch with the restaurants below if you need help, no questions asked.\n\n**Please note** this is not a definitive list, please get in touch if you want to be added. *If you are a food related business and keen to help over Christmas holidays and future half terms please email hello @ dealdelivers.com with the subject 'School Meals'.*\n\n**Cin Cin Bar** Staff have volunteered their time and are offering breakfast club from Monday 26th - Friday 30th October 8am - 11am. Book (no questions asked) Visit their **[Facebook page](https://www.facebook.com/cincinbarandbistro)**\n\n**Soulchef Catering** from Wednesday to Friday from 12. Thursday from 3pm. At the Astor Theatre. Order here 07871176466.  Visit their [Facebook page](https://www.facebook.com/Soulchefcatering/)\n\n**Jill Martin, The Town Kitchen : Tuesday 27th October,** Jill will be making Spaghetti Bolognese. Contact via **[Facebook](https://www.facebook.com/TheDealTownKitchen/)** \n\n**The Lane Bakery** will be offering free kids lunch boxes to anyone in need next week *Available for collection between: **11am and 3pm on Wednesday 28th**. Please fill in [this form online](https://www.thelanebakery.co.uk/free-kids-meals) to book* Limited availability \\\n\\\n**Brunch Box** is offering free packed lunches. **[Contact via Facebook](https://www.facebook.com/82millhill)**\n\n**The Taphouse** are donating £50 per week to the Deal Food Bank. You can also donate non-perishable food at their venue. More info on [their Facebook](https://www.facebook.com/thetaphousedeal)\n\n**Market Square Kitchen (Dover),** the sister restaurant to Chantilly’s Bakeryis offering free kids packed lunches Monday - Sunday 10-3pm just pop by.  More details on their [Facebook](https://www.facebook.com/Themarketsquarekitchen)\n\n**The Sportsman in Sholden** is offering free lunches to children under 12 and must be accompanied by an adult.  They are also offering free tea and coffee to the adults. Lunches 12 - 2pm.  Please call to book 01304380321\n\n**Wellingtons** have partnered with **BoCakes** and **Rooks** to offer 100 packed lunches, pop in to collect. Delivery available **[Contact](http://www.apple.com)** or 01304 361777\n\n**The Meatball Company** is offering half price meatballs for kids all week. **[Order online.](https://www.facebook.com/watch/TheMeatballCompanyDeal/)**\n\n**The Goose on the Green** is offering free meals to kids. Check out their menu on **[Facebook here](https://www.facebook.com/GooseontheGreenCafe)** . Closed on Wednesdays.\n\n**Betteshanger Welfare Football Club** in Cavell Square will be open FRI, SAT & SUN providing free meals to all children, whether they play football or not just visit the club cafe\\\n\\\n**The Fryer Tuck**  get in touch for a kids fish and chips plus a piece of fruit. More [info here](https://www.facebook.com/FryerTuckDeal)\n\n##### And visit:\n\n##### Kent County Council are offering £15 holiday food vouchers, [apply here](https://www.kent.gov.uk/education-and-children/schools/free-school-meals)\n\n##### Deal Area Food Bank [ here](https://dealarea.foodbank.org.uk/)\n\n**United Families Deal [ here](https://www.facebook.com/unitedfamilyuk)**"
  },
  {
    "id": "5-socially-distanced-ideas-for-halloween",
    "title": "5 Socially Distanced Ideas for Halloween",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603198212/halloween_tzgyxk.jpg",
    "date": "2020-10-19T23:00:00.000Z",
    "content": "Trick or Treating might not be the done thing this year... but with Halloween being a big deal in the kiddy calendar it's even more important to make an effort this year and have a bit of fun - if that's still allowed ;)\n\n#### 1. Sweeten things up\n\nSweets delivered became a big thing over lockdown. Lollipop Ladies were dropping off gift boxes to chirp up families, movie nights to alternative birthday cakes. Their nostalgic Halloween selection makes the perfect selection for 'Going Ghosting' - this is when you leave suprise treats on friends doorsteps. Altogether now..'Ahhhhhhhh' - . Find them on [Facebook](https://www.facebook.com/lollipopladieshire)\n\n![lollipop ladies Deal](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603125730/sweet-delivery_hz2yvj.jpg)\n\n#### 2. Enjoy a Halloween Fiesta\n\nSalentino's are going all out to make sure Halloween doesn't get forgotten this year. Mocktails, pumpkin carving at your table and a goody bag to take home. Billed (by Salentinos) as 'the ultimate trick or treating house', sounds pretty good to us! [Find out more >>](https://www.salentinos.com/halloween-2020)\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603126425/Screen_Shot_2020-10-19_at_17.52.18_a6e748.png)\n\n#### **3. Buy Decorations for Life**\n\nIf, like us, you think decorations are for life not just for Halloween... Emily Stone sculpts animals from copper, and her bats and spiders have the most wonderful detail, you'll find them impossible to put away. Discover artist [Emily Stone](https://www.coppercreatures.co.uk/) >>\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603127045/emily-stone_szckxe.jpg)\n\n#### 4. Halloween Geocashing\n\nThey've done it again... Betteshanger saves Halloween with pumpkin carving, Halloween Geocashing and a spooky Halloween trail (can we join in please?!). You could become a member and support all their brilliant activities. [Betteshanger this way >](https://www.betteshanger-park.co.uk/)\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603197149/halloween-deal_nidfsf.png)\n\n#### 5. Watch a Scary Movie\n\nHop in your car and head to the Canterbury Drive-in cinema. You can't get much scarier than [The Exorcist](https://thelittleboxoffice.com/kentdriveincinema/event/view/130907) on October 31st. Ditch the popcorn - we recommend getting one of Mary's delcious [Seagraze](https://www.seagraze.co.uk/) boxes. These new grazing boxes are packed with the finest meats and cheeses. Get one delivered before you go for a movie night to remember.\n\n![](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603198104/Screen_Shot_2020-10-20_at_13.47.26_ctjn3s.png)"
  },
  {
    "id": "meet-sarah-jane-from-daisy-green-the-holistic-shed",
    "title": "Meet Sarah Jane from Daisy Green The Holistic Shed",
    "cover": "https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603292558/IMG_1499_ge6apb.jpg",
    "date": "2020-10-18T17:08:20.844Z",
    "content": "The first in our weekly series is talented therapist Sarah Jane McGahan at ***[Daisy Green The Holistic Shed](https://www.facebook.com/sarahmcgahan.daisygreen)*,** a rather unique spa run from a peaceful shed in Sarah’s back garden. Sarah’s pampering products and home ‘treat’ment kits helped kept us sane(ish!) during lockdown and she has rave 5* reviews on Facebook.\n\n![deal delivers daisy green holistic shed](https://res.cloudinary.com/dealdelivers/image/upload/c_limit,f_auto,q_80,w_500/v1603292558/IMG_1498_vn19fy.jpg)\n\nSarah is a holistic therapist, born and bred in Deal. She is married with two children, one aged 22 living independently and a 17 year old still at home busy studying for A levels - oh, and tortoise Terence Trent (after singer D’Arby, cross our hearts).\n\n> I have always loved beauty products and when I first went for a spa day I decided it was the career for me! When my son was two, I enrolled in adult education and qualified as a beauty therapist and compelted a holistc massage course followed by various jobs in spas and salons including spa manager for a leading skincare bran. I took the plunge to set up on my own three years ago. I invested in a rather wonderful shed in my garden, my natural skincare studio, where I like to treat people’s skin beautifully, help their aches and pains, give my clients a moment in their packed lives for some hard-earned ‘me-time’ to think about nothing and even nap away from their kids and job. In the sanctuary of the shed, I offer bespoke holistic facials, hot stone massage, head massage, body scrubs, waxing, manicures, pedicures and pregnancy treatments. I love talking to people to really get what makes them tick, what they need so I can best help them. I also offer a bespoke organic product range from Surrey starting at £15 and make my own lavender body scrubs. Our pamper baskets from £20 are ready for gifting anytime, especially at Christmas and individual products will be ethically wrapped in scarves made out of recycled saris I select from another local independent.\n>\n> During lockdown, I had to shut my spa business which was utterly heart-breaking. I’m not afraid to say I’m an emotional person, so many tears were shed. My pampering products were all sitting in the spa, so I decided to make up face and body pamper packs and deliver them to my customers at home… literally on my bike!\n>\n> I contacted all my customers to tell them I had to close and offering them our product packs. I was so relieved when they loved the idea: deliveries kept my mind and brain ticking over, my body out in the fresh air with spa deliveries in my ‘granny-style’ bike basket! Most of my orders came via the Deal Delivers facebook page, which accounted for about 60% of the business - a total lifeline for me to pay the bills. People wanted to treat themselves, and get back to a bit of normality when times were anything but normal. Treat night in like mum and daughter pedis were particularly popular.\n>\n> Now government guidelines have changed, thankfully I am back open. Our ‘one in one out’ is easier to control in my shed spa than a salon. Deliveries have reduced but we are making up special Christmas hampers and seeing gift vouchers rising as more people have heard about us and Christmas creeps up!\n\n### **Favourite Things**\n\n#### 1. The beach\n\nI know it’s a bit of a cliché, but the beach is where I’m happy and is at the centre of many of my fond memories growing up here in Deal. A walk along the sea front is where I go for time to myself, to get some fresh air and clear my thoughts, although I have never seen the beach so busy as this year! I always notice if you are in the car coming from London, as you get towards Dover the air quality changes. I like to go early, about 6am and usually stroll between Deal and Sandown Castle. Some days the sea is tranquil, other days its crazy and I often see the ‘Deal seal’. Can anyone tell me if there’s more than one?\n\n#### 2. Deal People\n\nThere is so much community spirit here in Deal, in a crisis like we have just had, it is heartening to see everyone rallying together to help each other out and get through together. Deal has history, charm, character and smiley people- no wonder we are becoming ever more popular.\n\n#### 3. Kingsdown Woods\n\nWith the seafront one side, in just a couple of minutes’ walk you can be in the woods, through the fields or along the cliffs exploring all the wonderful nature of the area, butterflies, bees, flowers… I particularly love seeing and smelling the carpet of bluebells in Kingsdown Woods in the spring and snowdrops in the winter.\n\n#### 4. St Margaret’s and Sandwich Bays\n\nA walk along the cliffs to the cosy beach at St Margaret’s is lovely, with a bonus it’s not so well known, so less busy or crowded. You can have a well-earned drink at **[The Coastguard](https://thecoastguard.co.uk/)** and I sometimes walk on to Dover. Sandwich Bay is beautiful, we sometimes take our campervan during the day and make our lunch in our little kitchen, maybe a nice chicken salad with meat, breads and dips from **[Deal’s wonderful Saturday market](https://www.facebook.com/DealTownMarket)**. I particularly appreciate the greengrocers and good quality meat from the butcher there. I’d also recommend a day trip to Rye, especially the nature reserve where we saw a family of seals recently.\n\n#### 5. Top restaurants\n\n**[The Thai Restaurant](https://www.bangkokpavilion.co.uk/)** on High Street and [Beach Street Table 81](https://81beachstreet.co.uk/) are our favourites so far. Located opposite The Royal Hotel, I think 81’s burgers and sea bass are particularly good, really lovely food. Two years ago, I travelled Thailand for four weeks and fell in love with the spiciness of Thai food. A Pad Thai or Red Thai curry with Udon noodles on the High Street brings those magical memories back…\n\n#### \\\n6. Urban Chic\n\nThe owners at [Urban Chic](http://www.urbanchicltd.co.uk/), Claire and Dawn are so friendly. I love their clothes, my most recent purchase being a T Shirt and I can always find little gifts for people.\n\n#### \\\n7. Local Food\n\n[Jill Martin of Town Kitchen](https://www.facebook.com/jill.martin.1460) has a stall at the Saturday Market where I am always tempted by her delicious sausage rolls and curries. I was also introduced to the scrummy [Hotsie Totsie cakes](https://www.facebook.com/hotsytotsycb) and bakes by Jill’s daughter Jessica Martin through the Deal Delivers page and have become a regular customer. Can I recommend her gin and tonic cake? Mmmm. I went to a ‘Ladies at Lunch’ event recently where Jill was the guest speaker and her daughter Jessica made the delicious dessert. To attend the event advertised online, you have to get in quick for the few spaces round Jill’s kitchen table… which is also in her garden shed. There’s clearly a theme!\n\n##### You can book spa treatments, vouchers or products with Sarah on [Daisy45green at gmail dot com](mailto:Daisy45green@gmail.com) or call 07504 023086"
  }
]